import { lazy } from "react";

export const menuItems = [
  {label: "خانه"},
  { label: "لوازم جانبی موبایل و کامپیوتر",
    subMenu: [
        {label: "هولدر و نگهدارنده"},
        {label: "تجهیزات ذخیره سازی",
            subMenu: [
                {label: "فلش مموری"},
                {label: "کارت حافظه"},
                {label: "هارد اکسترنال"}
            ]
        },
        {label: "اسپیکر"},
        {label: "ماوس و کیبورد و پدموس"},
        {label: "هندزفری و هدست، میکروفون",
            subMenu: [
                {label: "میکروفون"},
                {label: "هندزفری سیم دار"},
                {label: "هدست سیم دار"},
                {label: "هدفون بلوتوث"},
                {label: "هندزفری بلوتوث دو گوش"},
                {label: "هندزفری بلوتوث دورگردنی"},
                {label: "هندزفری بلوتوث تک گوش"}
            ]
        },
        {label: "پاوربانک و جامپ استارتر"},
        {label: "کابل شارژ",
            subMenu: [
                {label: "کابل شارژ  میکرو یو اس بی"},
                {label: "کابل شارژ تایپ سی"},
                {label: "کابل شارژ لایتنینگ"},
                {label: "کابل شارژ  دو سر تایپ سی"},
                {label: "کابل شارژ  تایپ سی به لایتنینگ"},
                {label: "کابل شارژ  سه کاره"},
                {label: "کابل شارژ سامسونگ"},
                {label: "کابل شارژ آیفون"}
            ]
        },
        {label: "آداپتور و شارژر",
            subMenu: [
                {label: "شارژر دیواری"},
                {label: "شارژر وایرلس"},
                {label: "شارژر رومیزی"},
                {label: "شارژر فندکی"},
                {label: "شارژر سامسونگ"},
                {label: "شارژر آیفون"}
            ]
        },
        {label: "دسته بازی و خنک کننده موبایل"},
        {label: "انواع تبدیل برق"},
        {label: "کابل و دانگل انتقال تصویر"},
        {label: "انواع هاب"},
        {label: "فن خنک کننده کامپیوتر"},
        {label: "قاب و گلس"}
    ]
   },
   {label: "کابل - مبدل - رابط",
    subMenu: [
        {label: "کابل HDMI"},
        {label: "کابل پرینتر"},
        {label: "کابل هارد اکسترنال"},
        {label: "انواع رابط و تبدیل"},
        {label: "کابل AUX"},
        {label: "کابل 2 به 1 صدا"},
        {label: "کابل اپتیکال"},
        {label: "کابل و فیش OTG"}
    ]
   },
  { label: "لوازم تولید محتوا",
    subMenu: [
        {label: "میکروفون"},
        {label: "رینگ لایت و پایه"},
    ]
  },
  { label: "لوازم شبکه",
    subMenu: [
        {label: "مودم - روتر"},
        {label: "هاب شبکه"},
        {label: "مودم همراه"},
        {label: "لوازم  جانبی"}
    ]
   },
  { label: "کنسول بازی و لوازم جانبی",
    subMenu: [
        {label: "هندزفری و هدست"},
        {label: "دسته بازی"},
        {label: "موس و کیبورد"},
        {label: "کیف"},
        {label: "کنسول"},
        {label: "شارژر دسته بازی"},
    ]
   },
  {label: "لوازم خانگی و شخصی",
    subMenu: [
        {label: "انواع گجت های جذاب"},
        {label: "باتری و شارژر"},
        {label: "اندروید باکس و گیرنده دیجیتال"},
        {label: "آنتن رومیزی"},
        {label: "مچ بند و ساعت هوشمند"},
        {label: "محصولات کمبو"},
        {label: "رابط برق و USB"},
        {label: "اف ام پلیر"},
    ]
  },
  {label: "برند‌ها"}
];
